model {
  ssd {
    num_classes: 3
    image_resizer {
      keep_aspect_ratio_height_resizer {
        height: 512
      }
    }
    feature_extractor {
      type: "ssd_mobilenet_v2_fpn"
      depth_multiplier: 1.0
      min_depth: 16
      conv_hyperparams {
        regularizer {
          l2_regularizer {
            weight: 4e-05
          }
        }
        initializer {
          truncated_normal_initializer {
            mean: 0.0
            stddev: 0.03
          }
        }
        activation: RELU_6
        batch_norm {
          decay: 0.9997
          center: true
          scale: true
          epsilon: 0.001
          train: true
        }
      }
      pad_to_multiple: 32
      use_explicit_padding: true
      use_depthwise: true
      fpn {
        min_level: 3
        max_level: 7
      }
    }
    box_coder {
      faster_rcnn_box_coder {
        y_scale: 10.0
        x_scale: 10.0
        height_scale: 5.0
        width_scale: 5.0
      }
    }
    matcher {
      argmax_matcher {
        matched_threshold: 0.4
        unmatched_threshold: 0.4
        ignore_thresholds: false
        negatives_lower_than_unmatched: true
        force_match_for_each_row: true
      }
    }
    similarity_calculator {
      iou_similarity {
      }
    }
    box_predictor {
      convolutional_box_predictor {
        conv_hyperparams {
          regularizer {
            l2_regularizer {
              weight: 4e-05
            }
          }
          initializer {
            random_normal_initializer {
              mean: 0.0
              stddev: 0.01
            }
          }
          activation: RELU_6
          batch_norm {
            decay: 0.997
            scale: true
            epsilon: 0.001
          }
        }
        min_depth: 256
        max_depth: 256
        num_layers_before_predictor: 4
        kernel_size: 3
        class_prediction_bias_init: -4.6
      }
    }
    anchor_generator {
      flexible_grid_anchor_generator {
        anchor_grid {
          base_sizes: 13.683776
          base_sizes: 19.276854
          base_sizes: 28.391773
          base_sizes: 30.942528
          base_sizes: 22.613028
          base_sizes: 8.498432
          aspect_ratios: 0.41142857
          aspect_ratios: 0.47786885
          aspect_ratios: 0.25724086
          aspect_ratios: 3.090909
          aspect_ratios: 0.69648343
          aspect_ratios: 0.6
          height_stride: 8
          height_stride: 8
          height_stride: 8
          height_stride: 8
          height_stride: 8
          height_stride: 8
          width_stride: 8
          width_stride: 8
          width_stride: 8
          width_stride: 8
          width_stride: 8
          width_stride: 8
          height_offset: 4
          height_offset: 4
          height_offset: 4
          height_offset: 4
          height_offset: 4
          height_offset: 4
          width_offset: 4
          width_offset: 4
          width_offset: 4
          width_offset: 4
          width_offset: 4
          width_offset: 4
        }
        anchor_grid {
          base_sizes: 41.01122
          base_sizes: 37.097923
          base_sizes: 26.947851
          base_sizes: 58.660343
          base_sizes: 51.993847
          base_sizes: 40.308147
          aspect_ratios: 0.27739727
          aspect_ratios: 0.56966144
          aspect_ratios: 1.2065217
          aspect_ratios: 0.254621
          aspect_ratios: 0.54545456
          aspect_ratios: 1.2352941
          height_stride: 16
          height_stride: 16
          height_stride: 16
          height_stride: 16
          height_stride: 16
          height_stride: 16
          width_stride: 16
          width_stride: 16
          width_stride: 16
          width_stride: 16
          width_stride: 16
          width_stride: 16
          height_offset: 8
          height_offset: 8
          height_offset: 8
          height_offset: 8
          height_offset: 8
          height_offset: 8
          width_offset: 8
          width_offset: 8
          width_offset: 8
          width_offset: 8
          width_offset: 8
          width_offset: 8
        }
        anchor_grid {
          base_sizes: 82.02244
          base_sizes: 74.25218
          base_sizes: 117.33356
          base_sizes: 60.15092
          base_sizes: 92.07996
          aspect_ratios: 0.27739727
          aspect_ratios: 0.58516484
          aspect_ratios: 0.2828295
          aspect_ratios: 1.1320754
          aspect_ratios: 1.4375
          height_stride: 32
          height_stride: 32
          height_stride: 32
          height_stride: 32
          height_stride: 32
          width_stride: 32
          width_stride: 32
          width_stride: 32
          width_stride: 32
          width_stride: 32
          height_offset: 16
          height_offset: 16
          height_offset: 16
          height_offset: 16
          height_offset: 16
          width_offset: 16
          width_offset: 16
          width_offset: 16
          width_offset: 16
          width_offset: 16
        }
        anchor_grid {
          base_sizes: 169.02544
          base_sizes: 114.778366
          base_sizes: 240.92885
          base_sizes: 158.87605
          base_sizes: 231.46901
          base_sizes: 146.81549
          aspect_ratios: 0.32258064
          aspect_ratios: 0.6345178
          aspect_ratios: 0.28874388
          aspect_ratios: 0.73275864
          aspect_ratios: 0.46830052
          aspect_ratios: 1.9005408
          height_stride: 64
          height_stride: 64
          height_stride: 64
          height_stride: 64
          height_stride: 64
          height_stride: 64
          width_stride: 64
          width_stride: 64
          width_stride: 64
          width_stride: 64
          width_stride: 64
          width_stride: 64
          height_offset: 32
          height_offset: 32
          height_offset: 32
          height_offset: 32
          height_offset: 32
          height_offset: 32
          width_offset: 32
          width_offset: 32
          width_offset: 32
          width_offset: 32
          width_offset: 32
          width_offset: 32
        }
        anchor_grid {
          base_sizes: 246.95871
          base_sizes: 318.9192
          base_sizes: 257.66956
          base_sizes: 324.75345
          base_sizes: 433.05484
          aspect_ratios: 0.7894737
          aspect_ratios: 0.6086106
          aspect_ratios: 1.3919414
          aspect_ratios: 1.0045147
          aspect_ratios: 1.0148883
          height_stride: 128
          height_stride: 128
          height_stride: 128
          height_stride: 128
          height_stride: 128
          width_stride: 128
          width_stride: 128
          width_stride: 128
          width_stride: 128
          width_stride: 128
          height_offset: 64
          height_offset: 64
          height_offset: 64
          height_offset: 64
          height_offset: 64
          width_offset: 64
          width_offset: 64
          width_offset: 64
          width_offset: 64
          width_offset: 64
        }
        normalize_coordinates: true
      }
    }
    post_processing {
      batch_non_max_suppression {
        score_threshold: 0.3
        iou_threshold: 0.6
        max_detections_per_class: 100
        max_total_detections: 100
      }
      score_converter: SIGMOID
    }
    normalize_loss_by_num_matches: true
    loss {
      localization_loss {
        weighted_smooth_l1 {
        }
      }
      classification_loss {
        weighted_sigmoid_focal {
          gamma: 2.0
          alpha: 0.25
        }
      }
      classification_weight: 1.0
      localization_weight: 1.0
    }
    encode_background_as_zeros: true
  }
}
train_config {
  batch_size: 11
  data_augmentation_options {
    random_horizontal_flip {
    }
  }
  data_augmentation_options {
    ssd_random_crop_fixed_aspect_ratio {
      operations {
        min_object_covered: 1.0
        min_area: 0.1
        max_area: 1.0
        overlap_thresh: 0.7
        random_coef: 0.0
        clip_boxes: true
      }
    }
  }
  data_augmentation_options {
    random_adjust_brightness {
    }
  }
  data_augmentation_options {
    random_adjust_contrast {
    }
  }
  data_augmentation_options {
    random_adjust_saturation {
    }
  }
  data_augmentation_options {
    resize_image {
      new_height: 512
      new_width: 512
    }
  }
  optimizer {
    momentum_optimizer {
      learning_rate {
        exponential_decay_learning_rate {
          initial_learning_rate: 0.00014
          decay_steps: 40000
          decay_factor: 0.5
        }
      }
      momentum_optimizer_value: 0.9
    }
    use_moving_average: false
  }
  fine_tune_checkpoint: "./ssd_mobilenet_v2_coco_2018_03_29/model.ckpt"
  from_detection_checkpoint: true
  num_steps: 300000
  startup_delay_steps: 0.0
  replicas_to_aggregate: 8
  max_number_of_boxes: 100
  unpad_groundtruth_tensors: false
  fine_tune_checkpoint_type: "detection"
}
train_input_reader {
  allegro_input_reader {
    dataview_name: ""
  }
}
eval_config {
  num_visualizations: 20
  num_examples: 100
  eval_interval_secs: 10800
  metrics_set: "coco_detection_metrics"
  use_moving_averages: false
  include_metrics_per_category: true
  all_metrics_per_category: true
}
eval_input_reader {
  allegro_input_reader {
    dataview_name: ""
    dataset_instances_num: 1
  }
}
